{
      "sections": [
            {
                  "title": "Welcome to Deals!",
                  "paragraphs": [
                        "By downloading or using the Deals mobile application, you agree to be bound by the following terms and conditions. Please read them carefully."
                  ]
            },
            {
                  "title": "1. Purpose",
                  "paragraphs": [
                        "Deals offers access to promotional offers and discount codes (“Promo Codes”) from third-party merchants in the UAE and internationally."
                  ]
            },
            {
                  "title": "2. User Eligibility",
                  "paragraphs": [
                        "You must be at least 18 years old to use this app or have parental consent."
                  ]
            },
            {
                  "title": "3. Use of Promo Codes",
                  "bullets": [
                        "Promo codes are provided for personal, non-commercial use only.",
                        "We do not guarantee the accuracy, availability, or effectiveness of any promo code.",
                        "Codes may expire or change at the discretion of the merchant."
                  ]
            },
            {
                  "title": "4. User Accounts",
                  "bullets": [
                        "You may need to register an account to use certain features.",
                        "You are responsible for maintaining the confidentiality of your account information."
                  ]
            },
            {
                  "title": "5. Intellectual Property",
                  "paragraphs": [
                        "All content within the App, including logos, design, and text, are the property of Deals or its partners and protected by law."
                  ]
            },
            {
                  "title": "6. Prohibited Uses",
                  "paragraphs": [
                        "Users agree not to:"
                  ],
                  "bullets": [
                        "Use the App for unlawful purposes.",
                        "Attempt to gain unauthorized access to the App or its servers.",
                        "Reverse engineer or copy the App’s source code."
                  ]
            },
            {
                  "title": "7. Limitation of Liability",
                  "paragraphs": [
                        "We are not liable for:"
                  ],
                  "bullets": [
                        "Inaccurate or expired promo codes.",
                        "Damages arising from reliance on third-party offers or services.",
                        "Any technical issues or loss of data."
                  ]
            },
            {
                  "title": "8. Modification and Termination",
                  "paragraphs": [
                        "We reserve the right to modify or terminate the App or these terms at any time. Continued use after updates means you accept the changes."
                  ]
            },
            {
                  "title": "9. Governing Law",
                  "paragraphs": [
                        "These terms are governed by the laws of the United Arab Emirates."
                  ]
            },
            {
                  "title": "10. Contact",
                  "paragraphs": [
                        "For questions, contact us at: support@appname.com."
                  ]
            }
      ]
}